app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "williamribeiro.pro@gmail.com"], ["password_digest", "$2a$10$QsP5.yLdor8ul8iI4eECDOlp7rvG.3ocLedlblFwmkD9YZDhsch86"]]
INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "willy91330@gmail.com"], ["password_digest", "$2a$10$fEgnkwU5i.Cgsrox63jySOa717wL16lGVntt1guyjrzm2srnSdMB2"]]
---
  def create
    @user = User.create(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$qOF6k1L1ezOOy0aLv.kgq.1u4ciyJ.nmxrXk4eE2QyA2o9j21.HXy"], ["id", 19]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)